posts/2019-02-10-prayer-for-the-fifth-sunday-of-epiphany.org
#+title: Prayer for the Fifth Sunday of Epiphany
#+date: <2019-02-10>


Lord Jesus,

When the disciples heard your voice,\\
they left everything they had\\
to follow you.

Examine our hearts, Lord,\\
and show us those things that\\
we also need to abandon,\\
those remnants of an earthly kingdom\\
That have no place in the Kingdom of God:

The need to win,

The need to get our way,

Our feelings of superiority\\
to our brothers and sisters,

Our tendency to seek our own will,\\
and to call it yours.

We have muffled your voice\\
in the frenzied noise\\
Of modern life;

Lest we hear,\\
and, like the disciples,\\
be compelled to follow.

Yet in those occasional\\
moments of stillness,\\
we find that you still call.

We pray to God\\
that we can still hear.

/Amen/

