docs/posts/2019-02-10-prayer-for-the-fifth-sunday-of-epiphany.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 31, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Prayer for the Fifth Sunday of Epiphany</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Prayer for the Fifth Sunday of Epiphany</h1>
<p class="subtitle" role="doc-subtitle">Feb 10, 2019</p>
</header><p>
Lord Jesus,
</p>

<p>
When the disciples heard your voice,<br>
they left everything they had<br>
to follow you.
</p>

<p>
Examine our hearts, Lord,<br>
and show us those things that<br>
we also need to abandon,<br>
those remnants of an earthly kingdom<br>
That have no place in the Kingdom of God:
</p>

<p>
The need to win,
</p>

<p>
The need to get our way,
</p>

<p>
Our feelings of superiority<br>
to our brothers and sisters,
</p>

<p>
Our tendency to seek our own will,<br>
and to call it yours.
</p>

<p>
We have muffled your voice<br>
in the frenzied noise<br>
Of modern life;
</p>

<p>
Lest we hear,<br>
and, like the disciples,<br>
be compelled to follow.
</p>

<p>
Yet in those occasional<br>
moments of stillness,<br>
we find that you still call.
</p>

<p>
We pray to God<br>
that we can still hear.
</p>

<p>
<i>Amen</i>
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 31, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
